[
	{
		"id": 1,
		"name": "Expo24",
		"description": "EXPO24 is an innovative web application that transforms the traditional showcase of final-year projects by third-year students at Erasmushogeschool into a dynamic and immersive virtual exhibition. The platform is designed to provide a seamless experience for attendees, offering comprehensive details about the event, including its purpose, schedule, and key highlights. Visitors can explore a diverse array of student projects, each presented with rich content, including detailed descriptions, high-quality images, and a breakdown of the technologies utilized. An interactive section allows attendees to sign in and actively engage in live demonstrations, participate in Q&A sessions, and network with peers, industry professionals, and academics.Beyond project showcases, EXPO24 serves as a valuable resource hub, offering features such as event maps, speaker profiles, and downloadable materials to enhance the attendee experience. By fostering meaningful connections and celebrating innovation, EXPO24 aims to bridge the gap between academia and industry, spotlighting the creativity and technical expertise of Erasmushogeschool students while inspiring collaboration and professional growth.",
		"codeLanguage": ["React, ", "CSS, ", "JavaScript, ", "Express"],
		"image": "Expo24.png",
		"images": ["Expo24.png", "Programma.png", "TimeTable.png"],
		"githubLink": "https://github.com/KarstenVerherstraeten/Expo24",
		"year": "2024",
		"from": "Jun 4",
		"to": "Jun 21 2024 ",
		"GroupSize": "4",
		"role": "Frontend Developer",
		"skills": ["React, ", "CSS, ", "JavaScript, ", "Express"]
	},
	{
		"id": 2,
		"name": "Django Login",
		"description": "DubmSchool is a robust login system with an integrated dashboard, developed using the Django framework and Python. Initially unfamiliar with Django, I dedicated a week to mastering its fundamentals through official tutorials before diving into implementation.\n The login system allows users to register and sign in, with role-based functionality enabling personalized experiences. Depending on the assigned role (e.g., student or teacher), users gain access to specific features and actions. For instance, teachers can access additional tools and resources, while students have a streamlined interface designed for their needs. \nThe project showcases my ability to quickly learn new technologies and apply them to create practical, user-focused solutions, combining efficient backend programming with intuitive design.",
		"codeLanguage": "Django",
		"image": "DjangoLogin.png",
		"images": [
			"home.png",
			"login.png",
			"register.png",
			"dashboard.png",
			"addTask.png"
		],
		"githubLink": "https://github.com/KarstenVerherstraeten/DjangoLogin",
		"year": "2024",
		"from": "Nov 12",
		"to": "Nov 19 2024 ",
		"GroupSize": "1",
		"role": "Full stack Developer",
		"skills": ["Django"]
	},
	{
		"id": 3,
		"name": "Omogle",
		"description": "I set out to create a prototype using WebRTC, inspired by the classic chat app Omegle. This led me to build my own version, Omogle. Initially, I tried developing the project using React, but I quickly realized that taking on too much at once was slowing my progress. To simplify, I switched to using vanilla JavaScript for the foundation. I developed the frontend with HTML, CSS, and JavaScript, and implemented a WebSocket server for the backend. In just five days, I built a functional application that allows users to anonymously chat in real-time. While not perfect, the project features a straightforward and intuitive design, showcasing my ability to adapt and deliver a working prototype under tight constraints.",
		"codeLanguage": ["HTML, ", "CSS, ", "JavaScript, ", "websocket"],
		"image": "Omogle.png",
		"images": ["Omogle.png", "chatroom2.png", "Room3.png", "Omogle.png"],
		"githubLink": "https://github.com/KarstenVerherstraeten/Omogle-Vanilla",
		"year": "2024",
		"from": "Oct 1",
		"to": "Oct 10 2024 ",
		"GroupSize": "1",
		"role": "Full stack Developer",
		"skills": ["HTML, ", "CSS, ", "JavaScript, ", "websocket"]
	},
	{
		"id": 4,
		"name": "Jukebox",
		"description": "I decided to combine my love for music with technology by creating a jukebox using Spotify's extensive but strict APIs. Initially, I attempted to build the project in React, but the challenge stemmed from understanding Spotify's API documentation rather than the framework itself. To simplify, I started fresh with vanilla JavaScript for the frontend and a Node.js-based backend using Express, dotenv, CORS, and Axios. After thoroughly reviewing Spotify's documentation and following the necessary steps, I successfully retrieved my playlist. Implementing the playback system proved tricky due to licensing requirements that needed to be passed to my web application. Despite these challenges, the end result after five days is something I’m proud of. The jukebox now allows users to select songs, pause, and resume playback seamlessly.",
		"codeLanguage": ["HTML, ", "CSS, ", "JavaScript, ", "SpotifyAPI"],
		"image": "Jukebox.png",
		"images": ["Jukebox.png", "Jukebox.png", "Jukebox.png", "Jukebox.png"],
		"githubLink": "https://github.com/KarstenVerherstraeten/jukebox-vanilla",
		"year": "2024",
		"from": "Nov 19",
		"to": "Nov 28 2024 ",
		"GroupSize": "1",
		"role": "Full stack Developer",
		"skills": ["HTML, ", "CSS, ", "JavaScript, ", "SpotifyAPI"]
	},
	{
		"id": 5,
		"name": "QuizPulse",
			"description": "For this project, I decided to focus more on frontend development and started working with React, this time with greater success. Early on, I realized I wanted to incorporate recently learned WebSocket technology to enable seamless communication. This approach allowed the quizmaster to select questions and have them displayed to players through the server, accompanied by a synchronized timer to prevent overlaps. After five days of work, the result is a functional and interactive quiz system that effectively combines real-time updates with a smooth user experience.",
		"codeLanguage": ["React, ", "CSS, ", "JavaScript, ", "websocket"],
		"image": "QuizPulse.png",
		"images": ["QuizPulse.png", "quizmaster.png", "quizmaster_selected.png", "player.png"],
		"githubLink": "https://github.com/KarstenVerherstraeten/QuizPulse",
		"year": "2024",
		"from": "Oct 15",
		"to": "Oct 24 2024 ",
		"GroupSize": "1",
		"role": "Full stack Developer",
		"skills": ["React, ", "CSS, ", "JavaScript, ", "websocket"]
	}
]


